nekuneko/NeKuNeKo_SAMD_Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Stimey SAMD21G18A
# ---------------------------------------
nekuneko_stimey.name=Stimey SAMD21G18A
nekuneko_stimey.vid.0=0x1993
nekuneko_stimey.pid.0=0x0000
nekuneko_stimey.vid.1=0x1993
nekuneko_stimey.pid.1=0x000B
nekuneko_stimey.upload.tool=bossac
nekuneko_stimey.upload.protocol=sam-ba
nekuneko_stimey.upload.maximum_size=262144
nekuneko_stimey.upload.offset=0x2000
nekuneko_stimey.upload.use_1200bps_touch=true
nekuneko_stimey.upload.wait_for_upload_port=true
nekuneko_stimey.upload.native_usb=true
nekuneko_stimey.build.mcu=cortex-m0plus
nekuneko_stimey.build.f_cpu=48000000L
nekuneko_stimey.build.usb_product="Stimey SAMD21G18A"
nekuneko_stimey.build.usb_manufacturer="NekuNeko"
nekuneko_stimey.build.board=SAMD_STIMEY
nekuneko_stimey.build.core=arduino
nekuneko_stimey.build.extra_flags=-DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS -D__SAMD21G18A__ {build.usb_flags}
nekuneko_stimey.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
nekuneko_stimey.build.openocdscript=openocd_scripts/arduino_zero.cfg
nekuneko_stimey.build.variant=stimey
nekuneko_stimey.build.variant_system_lib=
nekuneko_stimey.build.vid=0x1993
nekuneko_stimey.build.pid=0x0000
nekuneko_stimey.bootloader.tool=openocd
nekuneko_stimey.bootloader.file=stimey/samd21_sam_ba_stimey.bin


# Gontak Sok Zero
# ---------------------------------------
nekuneko_sok_zero.name=Gontak Sok Zero
nekuneko_sok_zero.vid.0=0x1993
nekuneko_sok_zero.pid.0=0x0010
nekuneko_sok_zero.vid.1=0x1993
nekuneko_sok_zero.pid.1=0x001B
nekuneko_sok_zero.upload.tool=bossac
nekuneko_sok_zero.upload.protocol=sam-ba
nekuneko_sok_zero.upload.maximum_size=262144
nekuneko_sok_zero.upload.offset=0x2000
nekuneko_sok_zero.upload.use_1200bps_touch=true
nekuneko_sok_zero.upload.wait_for_upload_port=true
nekuneko_sok_zero.upload.native_usb=true
nekuneko_sok_zero.build.mcu=cortex-m0plus
nekuneko_sok_zero.build.f_cpu=48000000L
nekuneko_sok_zero.build.usb_product="Gontak Sok Zero"
nekuneko_sok_zero.build.usb_manufacturer="NekuNeko"
nekuneko_sok_zero.build.board=SAMD_STIMEY
nekuneko_sok_zero.build.core=arduino
nekuneko_sok_zero.build.extra_flags=-DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS -D__SAMD21GJ18A__ {build.usb_flags}
nekuneko_sok_zero.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
nekuneko_sok_zero.build.openocdscript=openocd_scripts/arduino_zero.cfg
nekuneko_sok_zero.build.variant=stimey
nekuneko_sok_zero.build.variant_system_lib=
nekuneko_sok_zero.build.vid=0x1993
nekuneko_sok_zero.build.pid=0x0010
nekuneko_sok_zero.bootloader.tool=openocd
nekuneko_sok_zero.bootloader.file=stimey/samd21_sam_ba_stimey.bin